import { useEffect, useRef } from "react";
import { useParams } from "react-router-dom";
import Map from "./components/Map";

function Maps() {
  const fullscreenRef = useRef<HTMLDivElement>(null);
  const params = useParams();

  const firstMap = [
    { x: 92, y: 63, description: "كان في كنيسة انطاكية انبياء و معلمين مجتمعين يخدموا ويصلوا ،قاد الروح القدس بولس وبرنابة لاول رحلة تبشيرية فصاموا وصلوا ،وشارك في هذه الرحلة يوحنا (المعروف بمرقس) ايضا" },
    { x: 89, y: 68, description: "ثاني محطات الرحلة التبشيرية الاولى" },
    { x: 83, y: 77, description: "كلم بولس و برنابة الناس بكلمة الله في مجامع اليهود " },
    { x: 77.4, y: 84, description: "كان والى بافوس اسمه سرجيوس بولس طلب من بولس و برنابا يكلموه بكلمة الله لاكن كان مع الوالى ساحر يهودي اسمه بار يشوع و له اسم اخر و هو عليم حاول بار يشوع انه يمنع الوالى انه يؤمن بالمسيح و لاكن امتلأ بولس من الروح القدس و نظر اليه و قال: 'يا ابن ابليس يد الرب عليك فتكون اعمى لا تبصر الى الحين' و في هذه اللحظة وقعت عليه ظلمة و طلب ان يمسك احد بيديه و امن الوالى سرجيوس بولس بالرب بعد ذالك" },
    { x: 69.4, y: 69.4, description: "مر بها بولس الرسول اثناء عودته الى انطكيا" },
    { x: 71.8, y: 66, description: "يوحنا ترك بولس و برنابا و ذهب الى اورشاليم بمجرد ما وصلوا الى ميناء برجة" },
    { x: 70, y: 58, description: "لخخ"},
    { x: 70.4, y: 44.5, description: "انطاكية بيسيدية: طلب رؤساء المجمع من بولس و برنابا انهم يوعظوا الشعب فقام بولس بوعظ الشعب عن كيف جاء المسيح من نسل داود و كلمهم عن موته و قيامته من الاموات و ان المسيح هو الطريق الوحيد للخلاص و بعد ما خرجوا من المجمع طلب الامم (ناس ليسوا من شعب اسرائيل) من بولس و برنابا انهم يوعظوهم السبت القادم و في يوم السبت تجمعت كل المدينة تقريبا ليسمعوا بولس و لاكن عندما راي اليهود بولس غاروا جدا و قاوموا كلام بولس و حرك اليهود كل المدينة ضد بولس و برنابا و طردوهم خارج المدينة" },
    { x: 76.2, y: 50.7, description: "دخل بولس و برنابا مجمع اليهود و بشروا بالمسيحية و امن الكثير من اليهود و اليونانيين بالمسيحية لاكن اليهود غير المؤمنين منعوا الامم عن الايمان و حرضوهم ضد بولس و برنابا فقرروا يرجموهم بالحجارة و لاكن استطاع بولس و برنابا الهرب" },
    { x: 74.6, y: 57, description: "في هذه المدينة وجد بولس و برنابا رجل عاجز الرجلين منذ ولادته فقال له بولس قم على رجليك فقفظ و صار يمشي ولاكن عندما راى الجموع هذا قالو: الاّلهة اخذوا شكل البشر و نزلو الينا و سموا برنابا زفس و بولس هرمس و اخذ كاهن زفس ثيران ليقدمها كذبيحة للرسولين فقطع بولس و برنابا ثيابهم و قالوا نحن بشر مثلكم و نبشركم ان تعودوا للاله الحى و بعد ذالك اتى اليهود و اقنعوا الجموع و رجموا بولس و جروه خارج المدينة و ظنوا ان بولس مات و لاكن عندما تجمع التلاميذ حول بولس قام و عاد الى المدينة " },
    { x: 78.5, y: 60, description: "بشر بولس و برنابا المدينة و اّمن عدد كبير بالرب و كانت هذه اخر محطة من محطات الرحلة التبشيرية الاولى و عاد بولس و برنابا من نفس الطريق" },
  ];
  const secondMap = [
    { x: 0, y: 0, description: "Location 1" },
    { x: 100, y: 100, description: "Location 2" },
  ];
  const thirdMap = [
    { x: 0, y: 0, description: "Location 1" },
    { x: 100, y: 100, description: "Location 2" },
    { x: 200, y: 200, description: "Location 3" },
  ];

  useEffect(() => {
    fullscreenRef.current?.requestFullscreen();
  }, []);

  return (
    <div ref={fullscreenRef}>
      <Map
        mapNumber={
          params.id === "first-journey"
            ? 1
            : params.id === "second-journey"
              ? 2
              : 3
        }
        points={
          params.id === "first-journey"
            ? firstMap
            : params.id === "second-journey"
              ? secondMap
              : thirdMap
        }
      />
    </div>
  );
}

export default Maps;
